zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/cy_device_headers.h
/***************************************************************************//**
* \file cy_device_headers.h
*
* \brief
* Common header file to be included by the drivers.
*
* \note
* Generator version: 1.3.0.1146
* Database revision: rev#1050929
*
********************************************************************************
* \copyright
* Copyright 2016-2018, Cypress Semiconductor Corporation. All rights reserved.
* SPDX-License-Identifier: Apache-2.0



*******************************************************************************/

#ifndef _CY_DEVICE_HEADERS_H_
#define _CY_DEVICE_HEADERS_H_

#if defined (CY8C6036BZI_F04)
    #include "cy8c6036bzi_f04.h"
#elif defined (CY8C6016BZI_F04)
    #include "cy8c6016bzi_f04.h"
#elif defined (CY8C6116BZI_F54)
    #include "cy8c6116bzi_f54.h"
#elif defined (CY8C6136BZI_F14)
    #include "cy8c6136bzi_f14.h"
#elif defined (CY8C6136BZI_F34)
    #include "cy8c6136bzi_f34.h"
#elif defined (CY8C6137BZI_F14)
    #include "cy8c6137bzi_f14.h"
#elif defined (CY8C6137BZI_F34)
    #include "cy8c6137bzi_f34.h"
#elif defined (CY8C6137BZI_F54)
    #include "cy8c6137bzi_f54.h"
#elif defined (CY8C6117BZI_F34)
    #include "cy8c6117bzi_f34.h"
#elif defined (CY8C6246BZI_D04)
    #include "cy8c6246bzi_d04.h"
#elif defined (CY8C6247BZI_D44)
    #include "cy8c6247bzi_d44.h"
#elif defined (CY8C6247BZI_D34)
    #include "cy8c6247bzi_d34.h"
#elif defined (CY8C6247BZI_D54)
    #include "cy8c6247bzi_d54.h"
#elif defined (CY8C6336BZI_BLF03)
    #include "cy8c6336bzi_blf03.h"
#elif defined (CY8C6316BZI_BLF03)
    #include "cy8c6316bzi_blf03.h"
#elif defined (CY8C6316BZI_BLF53)
    #include "cy8c6316bzi_blf53.h"
#elif defined (CY8C6336BZI_BLD13)
    #include "cy8c6336bzi_bld13.h"
#elif defined (CY8C6347BZI_BLD43)
    #include "cy8c6347bzi_bld43.h"
#elif defined (CY8C6347BZI_BLD33)
    #include "cy8c6347bzi_bld33.h"
#elif defined (CY8C6347BZI_BLD53)
    #include "cy8c6347bzi_bld53.h"
#elif defined (CY8C6347FMI_BLD13)
    #include "cy8c6347fmi_bld13.h"
#elif defined (CY8C6347FMI_BLD43)
    #include "cy8c6347fmi_bld43.h"
#elif defined (CY8C6347FMI_BLD33)
    #include "cy8c6347fmi_bld33.h"
#elif defined (CY8C6347FMI_BLD53)
    #include "cy8c6347fmi_bld53.h"
#elif defined (CY8C637BZI_MD76)
    #include "cy8c637bzi_md76.h"
#elif defined (CY8C637BZI_BLD74)
    #include "cy8c637bzi_bld74.h"
#elif defined (CY8C637FMI_BLD73)
    #include "cy8c637fmi_bld73.h"
#elif defined (CY8C68237BZ_BLE)
    #include "cy8c68237bz_ble.h"
#elif defined (CY8C68237FM_BLE)
    #include "cy8c68237fm_ble.h"
#elif defined (CY8C6137FDI_F02)
    #include "cy8c6137fdi_f02.h"
#elif defined (CY8C6117FDI_F02)
    #include "cy8c6117fdi_f02.h"
#elif defined (CY8C6247FDI_D02)
    #include "cy8c6247fdi_d02.h"
#elif defined (CY8C6247FDI_D32)
    #include "cy8c6247fdi_d32.h"
#elif defined (CY8C6336BZI_BUD13)
    #include "cy8c6336bzi_bud13.h"
#elif defined (CY8C6347BZI_BUD43)
    #include "cy8c6347bzi_bud43.h"
#elif defined (CY8C6347BZI_BUD33)
    #include "cy8c6347bzi_bud33.h"
#elif defined (CY8C6347BZI_BUD53)
    #include "cy8c6347bzi_bud53.h"
#elif defined (CY8C6337BZI_BLF13)
    #include "cy8c6337bzi_blf13.h"
#elif defined (CY8C6136FDI_F42)
    #include "cy8c6136fdi_f42.h"
#elif defined (CY8C6247FDI_D52)
    #include "cy8c6247fdi_d52.h"
#elif defined (PSoC6A2M_124BGA)
    #include "psoc6a2m_124bga.h"
#else
    #include "cy_device_common.h"
#endif

#endif /* _CY_DEVICE_HEADERS_H_ */


/* [] END OF FILE */
